# Utilizaçao do SQL através da biblioteca pandasql
# Using pandasql to train SQL
---
Research fonts: 
1.   https://www.youtube.com/c/ritvikmath
2.   https://pypi.org/project/pandasql/

---

# Import

In [2]:
# Ambient configuration

# $ pip install -U pandasql
# !pip install pandasql

Looking in indexes: https://pypi.org/simple, https://us-python.pkg.dev/colab-wheels/public/simple/
Collecting pandasql
  Downloading pandasql-0.7.3.tar.gz (26 kB)
Requirement already satisfied: numpy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.21.6)
Requirement already satisfied: pandas in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.3.5)
Requirement already satisfied: sqlalchemy in /usr/local/lib/python3.7/dist-packages (from pandasql) (1.4.40)
Requirement already satisfied: pytz>=2017.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2022.1)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.7/dist-packages (from pandas->pandasql) (2.8.2)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.7/dist-packages (from python-dateutil>=2.7.3->pandas->pandasql) (1.15.0)
Requirement already satisfied: importlib-metadata in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (4.12.0)
Requirement already satisfied: greenlet!=0.4.17 in /usr/local/lib/python3.7/dist-packages (from sqlalchemy->pandasql) (1.1.2)
Requirement already satisfied: zipp>=0.5 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (3.8.1)
Requirement already satisfied: typing-extensions>=3.6.4 in /usr/local/lib/python3.7/dist-packages (from importlib-metadata->sqlalchemy->pandasql) (4.1.1)
Building wheels for collected packages: pandasql
  Building wheel for pandasql (setup.py) ... done
  Created wheel for pandasql: filename=pandasql-0.7.3-py3-none-any.whl size=26784 sha256=0e7cf0cdc2f8d5a79faec3e5b7d9319f93728ea83c4371afbd4f21f3972d6f83
  Stored in directory: /root/.cache/pip/wheels/5c/4b/ec/41f4e116c8053c3654e2c2a47c62b4fca34cc67ef7b55deb7f
Successfully built pandasql
Installing collected packages: pandasql
Successfully installed pandasql-0.7.3

In [5]:
# Required libraries

import pandas as pd          # used to read the DataFrame
import numpy  as np          # used to create the DataFrame

from pandasql import sqldf

# Data

This dataframe was created from imaginary data of students in a certain classroom

In [6]:
data = {'aluno'       : ['João', 'Ribeiro', 'Evaldo', 'Isaias', 'Jessyca','Anne','Luiz'],    
        'idade'       : ['20', '29', '22', '21', '35', '32', '40'],    
        'cidade'      : ['São Paulo', 'São João', 'Pinhal', 'Mococa', 'Poços', 'Botelhos', 'Pinhal'],
        'aniversario' : ['021004', '030220', np.nan, '000420', '871212', '000101', np.nan] }

df = pd.DataFrame(data)

In [8]:
# Data type correction

df['aniversario'] = pd.to_datetime( df['aniversario'], format = '%y%m%d' )
df['idade'] = df['idade'].astype(int)

In [9]:
df

     aluno  idade     cidade aniversario
0     João     20  São Paulo  2002-10-04
1  Ribeiro     29   São João  2003-02-20
2   Evaldo     22     Pinhal         NaT
3   Isaias     21     Mococa  2000-04-20
4  Jessyca     35      Poços  1987-12-12
5     Anne     32   Botelhos  2000-01-01
6     Luiz     40     Pinhal         NaT

# SELECT

In [15]:
# Selecting all data

statement = "SELECT * FROM df LIMIT 5;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno  idade     cidade                 aniversario
0     João     20  São Paulo  2002-10-04 00:00:00.000000
1  Ribeiro     29   São João  2003-02-20 00:00:00.000000
2   Evaldo     22     Pinhal                        None
3   Isaias     21     Mococa  2000-04-20 00:00:00.000000
4  Jessyca     35      Poços  1987-12-12 00:00:00.000000

In [16]:
# Selecting name and age

statement = "SELECT aluno, idade FROM df LIMIT 5;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno  idade
0     João     20
1  Ribeiro     29
2   Evaldo     22
3   Isaias     21
4  Jessyca     35

Obs: The main function used in pandasql is sqldf. sqldf accepts 2 parametrs - a sql query string - an set of session/environment variables (locals() or globals())

# DISTINCT/ COUNT / AS

In [23]:
# Selecting distinct cities

statement = "SELECT DISTINCT cidade FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

      cidade
0  São Paulo
1   São João
2     Pinhal
3     Mococa
4      Poços
5   Botelhos

In [22]:
# Counting the amount of distinct cities

statement = "SELECT COUNT(DISTINCT cidade) AS num_cities FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

   num_cities
0           6

In [24]:
# Selecting distinct combinations of two cities

statement = "SELECT DISTINCT aluno, cidade FROM df;"

selected_data = sqldf(statement, globals())

print(selected_data)

     aluno     cidade
0     João  São Paulo
1  Ribeiro   São João
2   Evaldo     Pinhal
3   Isaias     Mococa
4  Jessyca      Poços
5     Anne   Botelhos
6     Luiz     Pinhal